'''
企业发放的奖金根据利润提成。
利润(I)低于或等于10万元时，奖金可提10%； ---1
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%； ---1+7500=17500
20万到40万之间时，高于20万元的部分，可提成5%；---17500+10000=27500
40万到60万之间时高于40万元的部分，可提成3%；----27500+6000=33500
60万到100万之间时，高于60万元的部分，可提成1.5%，---33500+6000=39500
高于100万元时，超过100万元的部分按1%提成，---39500+
从键盘输入当月利润I，求应发放奖金总数？
'''

I = int(input("输入利润："))
premium = 0
if I >= 0 and I <=10:
    prenium = 0.1 * I
elif I >10 and I <= 20:
    prenium = 0.75 * (I - 10) + 1
elif I >20 and I <=40:
    prenium = 0.5 * (I - 20) + 1.7500
elif I >40 and I <=60:
    prenium = 0.3 * (I - 40) + 2.7500
elif I >60 and I <=100:
    prenium = 0.15 * (I - 60) + 3.3500
elif I >100:
    prenium = 0.01 * (I - 100) + 3.9500
else:
    print("输入的数字有误。")
print("奖金为%s万元" %prenium)



i = int(input('净利润:'))
arr = [1000000,600000,400000,200000,100000,0]
rat = [0.01,0.015,0.03,0.05,0.075,0.1]
r = 0
for idx in range(0,6):
    if i>arr[idx]:
        r+=(i-arr[idx])*rat[idx]
        print((i-arr[idx])*rat[idx])
        i=arr[idx]
print(r)